TensorDT/uCOS-II_MC9S12DG256/Source/Application/software_traps.h
//*********************************************************************
//
//  File name:  software_traps.h
//
//  Purpose:    Interrupt software trap function module header file
//
//  Target:     MC9S12DG256-based board
//
//  Revisions:
//   ##  dd mmm yyyy  who  description
//    1  09 Dec 2020  GPM  Initial revision.
//
//  Notes:
//  (c) 2020 Tensor Drilling Technologies, Inc. All rights reserved.
//  (p) 2020 Tensor Drilling Technologies, Inc. All rights reserved.
//
//  Tensor Drilling Technologies
//  2418 North Frazier St., Suite 100
//  Conroe, TX 77303
//*********************************************************************

// Avoid multiple inclusions
#ifndef _software_traps_h
#define _software_traps_h

//--------------------------- Included Files --------------------------
#include "mc9s12dg256_banking.h"

//-------------------------- Type Definitions -------------------------
// none

//------------------------ Constant Definitions -----------------------
// none

//------------------------------- Macros ------------------------------
// none

//------------------------ Function Prototype(s) ----------------------

//-------------------------- Module Variables -------------------------

//------------------------------ Functions ----------------------------
_NEAR void SoftwareTrap64 (void);
_NEAR void SoftwareTrap63 (void);
_NEAR void SoftwareTrap62 (void);
_NEAR void SoftwareTrap61 (void);
_NEAR void SoftwareTrap60 (void);
_NEAR void SoftwareTrap59 (void);
_NEAR void SoftwareTrap58 (void);
_NEAR void SoftwareTrap57 (void);
_NEAR void SoftwareTrap56 (void);
_NEAR void SoftwareTrap55 (void);
_NEAR void SoftwareTrap54 (void);
_NEAR void SoftwareTrap53 (void);
_NEAR void SoftwareTrap52 (void);
_NEAR void SoftwareTrap51 (void);
_NEAR void SoftwareTrap50 (void);
_NEAR void SoftwareTrap49 (void);
_NEAR void SoftwareTrap48 (void);
_NEAR void SoftwareTrap47 (void);
_NEAR void SoftwareTrap46 (void);
_NEAR void SoftwareTrap45 (void);
_NEAR void SoftwareTrap44 (void);
_NEAR void SoftwareTrap43 (void);
_NEAR void SoftwareTrap42 (void);
_NEAR void SoftwareTrap41 (void);
_NEAR void SoftwareTrap40 (void);
_NEAR void SoftwareTrap39 (void);
_NEAR void SoftwareTrap38 (void);
_NEAR void SoftwareTrap37 (void);
_NEAR void SoftwareTrap36 (void);
_NEAR void SoftwareTrap35 (void);
_NEAR void SoftwareTrap34 (void);
_NEAR void SoftwareTrap33 (void);
_NEAR void SoftwareTrap32 (void);
_NEAR void SoftwareTrap31 (void);
_NEAR void SoftwareTrap30 (void);
_NEAR void SoftwareTrap29 (void);
_NEAR void SoftwareTrap28 (void);
_NEAR void SoftwareTrap27 (void);
_NEAR void SoftwareTrap26 (void);
_NEAR void SoftwareTrap25 (void);
_NEAR void SoftwareTrap24 (void);
_NEAR void SoftwareTrap23 (void);
_NEAR void SoftwareTrap22 (void);
_NEAR void SoftwareTrap21 (void);
_NEAR void SoftwareTrap20 (void);
_NEAR void SoftwareTrap19 (void);
_NEAR void SoftwareTrap18 (void);
_NEAR void SoftwareTrap17 (void);
_NEAR void SoftwareTrap16 (void);
_NEAR void SoftwareTrap15 (void);
_NEAR void SoftwareTrap14 (void);
_NEAR void SoftwareTrap13 (void);
_NEAR void SoftwareTrap12 (void);
_NEAR void SoftwareTrap11 (void);
_NEAR void SoftwareTrap10 (void);
_NEAR void SoftwareTrap09 (void);
_NEAR void SoftwareTrap08 (void);
_NEAR void SoftwareTrap07 (void);
_NEAR void SoftwareTrap06 (void);
_NEAR void SoftwareTrap05 (void);
_NEAR void SoftwareTrap04 (void);
_NEAR void SoftwareTrap03 (void);
_NEAR void SoftwareTrap02 (void);
_NEAR void SoftwareTrap01 (void);

#endif
